NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/multiphase/MPPICInterFoam/twoPhasePachuka/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     MPPICInterFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         14.0;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.0;

maxAlphaCo      1.0;

maxDeltaT       0.05;

functions
{
    minMax
    {
      type          fieldMinMax;
      libs          (fieldFunctionObjects);
      writeControl  timeStep; //writeTime;
      fields        (U);
    }
}


// ************************************************************************* //
